{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
      ],
      "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
          "Bye",
          "See you later",
          "Goodbye"
      ],
      "responses": [
          "Happy to help!",
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": [
          "Thanks",
          "Thank you",
          "That's helpful",
          "Thank's a lot!"            
      ],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "register",
      "patterns": [
        "How can I register on the Help Me Find It platform?",
        "How do I sign up?",
        "What do I need to do to register?"
      ],
      "responses": [
        "You can register by visiting our user registration page and providing your name, email address, ID or passport number, contact details, and next of kin contact details. This information helps us securely store your data and notify you if your lost items are found.",
        "You can register by visiting our [user registration page](https://www.hmfi.co.za/user_registration) and providing your name, email address, ID or passport number, contact details, and next of kin contact details."
      ]
    },
    {
      "tag": "report_found_item",
      "patterns": [
        "What information do I need to provide to report a found item?",
        "How do I report a found ID?",
        "What details are required to report a found passport?",
        "How do I report a found driver's license?",
        "How can I report a passport I found?"
        
      ],
      "responses": [
        "If you find an ID, driver's license, or passport, report it by visiting our post found item page. You will need to provide your name, contact details, and the ID or passport number of the found item. This allows us to notify the owner.",
        "To report a found item, visit our post found item page. Provide your name, contact details, and the ID or passport number of the found item.",
        "To report a found item, visit our [post found item page](https://www.hmfi.co.za/post_found_item). Provide your name, contact details, and the ID or passport number of the found item."
      ]
    },
    {
      "tag": "check_lost_item",
      "patterns": [
        "How do I check if someone has found my lost item?",
        "How can I search for my lost ID?",
        "What steps do I take to find my lost passport?"
      ],
      "responses": [
        "Visit our search lost item page and enter your ID or passport number. If your item has been reported found, the system will display the finder's name and contact details so you can reach out.",
        "Visit our [search lost item page](https://www.hmfi.co.za/search_lost_item) and enter your ID or passport number. If your item has been reported found, the system will display the finder's name and contact details."
      ]
    },
    {
      "tag": "unregistered_found_item",
      "patterns": [
        "What if I am not registered on the platform and someone finds my item?",
        "Can I search for my lost item if I'm not registered?",
        "What happens if someone finds my item and I'm not registered?"
      ],
      "responses": [
        "If you're not registered and someone finds your item, they can still report it. The system will save the finder's details. You can then visit our search lost item page, enter your ID or passport number, and retrieve the finder's contact information.",
        "Even if you're not registered, someone can still report your item. The system will save the finder's details, and you can search for your item using your ID or passport number.",
        "Even if you're not registered, someone can still report your item. The system will save the finder's details, and you can search for your item using your ID or passport number on our [search lost item page](https://www.hmfi.co.za/search_lost_item)."
      ]
    },
    {
      "tag": "lost_drivers_license",
      "patterns": [
        "What should I do if I've lost my driver's license?",
        "How can I report my lost driver's license?",
        "What steps should I take if I lose my driver's license?",
        "I lost my driver's license, what now?"
      ],
      "responses": [
        "Register on our platform using the user registration link to ensure you're notified if it's found. You can also check the search lost item page to see if anyone has reported finding it.",
        "Register on our platform to be notified if it's found. You can also check the search lost item page to see if anyone has reported finding it."
      ]
    },
    {
      "tag": "notification",
      "patterns": [
        "How does the platform notify me if my item is found?",
        "Will I be notified if my lost item is found?",
        "How will I know if my lost item is found?"
      ],
      "responses": [
        "Once a found item is reported, the platform sends a notification via SMS to the registered owner, providing details on how to contact the person who found the item.",
        "Once a found item is reported, the platform sends a notification via SMS to the registered owner with details on how to contact the person who found the item."
      ]
    },
    {
      "tag": "platform_fee",
      "patterns": [
        "Is there a fee for using the Help Me Find It platform?",
        "Do I have to pay to use the platform?",
        "Is the service free?"
      ],
      "responses": [
        "The platform is free to use for registering lost items, reporting found items, and searching for items."
      ]
    },
    {
      "tag": "security",
      "patterns": [
        "How secure is my personal information on the platform?",
        "Is my data safe on your platform?",
        "What measures are in place to protect my personal information?",
        "Is my personal data safe?",
        "How do you protect my privacy?"
      ],
      "responses": [
        "We prioritize your privacy and security. All personal information provided during registration is securely stored in our database and is only used to reconnect owners with their lost items, For more details, check out our [privacy policy](https://www.hmfi.co.za/privacy_policy).",
        "For more details, check out our [privacy policy](https://www.hmfi.co.za/privacy_policy)."
      ]
    },
    {
      "tag": "update_contact",
      "patterns": [
        "Can I update my contact information after registering?",
        "How do I change my contact details?",
        "What if my contact information changes?"
      ],
      "responses": [
        "Yes, you can update your contact information by logging into your account on our website and editing your profile details."
      ]
    },
    {
      "tag": "item_types",
      "patterns": [
        "What types of items can be reported on the platform?",
        "What items can I report as lost or found?",
        "Are there any restrictions on the types of items I can report?"
      ],
      "responses": [
        "You can report lost or found identity cards, driver's licenses, and passports. We do not currently support other types of lost items."
      ]
    },
    {
      "tag": "contact_support",
      "patterns": [
        "How can I contact customer support for further assistance?",
        "Who do I contact for help?",
        "Where can I find support?"
      ],
      "responses": [
        "You can contact our support team by using the contact form available on the 'Contact Us' page on our website or by emailing info@hmfi.co.za.",
        "You can contact our support team by using the [contact form](https://www.hmfi.co.za/contact) available on the 'Contact Us' page on our website or by emailing info@hmfi.co.za."
      ]
    },
    {
      "tag": "finder_contact_info",
      "patterns": [
        "How long will the platform keep the finder's contact information?",
        "How long is the contact information stored?",
        "What happens to the finder's details?"
      ],
      "responses": [
         "The finder's contact information will be stored until the item is claimed by the rightful owner or a reasonable period has passed, ensuring the owner has ample time to retrieve their item." 
      ]
    },
    {
      "tag": "report_anonymously",
      "patterns": [
          "Can I report a found item anonymously?",
          "Do I need to provide my contact details?",
          "Can I report without giving my information?"
      ],
      "responses": [
          "No, we require finders to provide their contact details to facilitate direct communication between the finder and the owner.",
          "No, we require finders to provide their contact details to facilitate direct communication between the finder and the owner. Please review our [terms of service](https://www.hmfi.co.za/terms_of_service) for more details."
      ] 
    },
    {
      "tag": "unregistered_finder",
      "patterns": [
          "What should I do if I find an item but the owner hasn't registered?",
          "Can I report an item if the owner isn't registered?",
          "What if the owner isn't on the platform?"
      ],
      "responses": [
          "Report the item on our post found item page. If the owner later registers or searches for their item, they will be able to access your contact information.",
          "Report the item on our [post found item page](https://www.hmfi.co.za/post_found_item). If the owner later registers or searches for their item, they will be able to access your contact information."
      ]
    },
    {
      "tag": "unclaimed_item",
      "patterns": [
          "What happens if I don't claim my found item after being notified?",
          "What if I don't claim my item?",
          "Can I claim my item later?"
      ],
      "responses": [
          "If a notification is sent and the item is not claimed, it remains in the system. You can still claim it later by following the instructions provided in the notification."
      ]
    },
    {
      "tag": "multi_language_support",
      "patterns": [
        "What languages does the platform support?",
        "Can I use the platform in languages other than English?",
        "Is the platform available in multiple languages?"
      ],
      "responses": [
        "Currently, the platform primarily supports English. We aim to expand language support in the future to accommodate more users."
      ]
    },
    {
      "tag": "search_without_registering",
      "patterns": [
          "Can I search for lost items without registering?",
          "Do I need to register to search for my lost item?",
          "Can I search without an account?"
      ],
      "responses": [
          "Yes, you can search for your lost items without registering by visiting the search lost item page and entering your ID or passport number.",
          "Yes, you can search for your lost items without registering by visiting the [search lost item page](https://www.hmfi.co.za/search_lost_item) and entering your ID or passport number."
      ]
    },
    {
      "tag": "update_found_item_details",
      "patterns": [
          "Can I edit the details of a found item after reporting it?",
          "How do I update a found item?",
          "Can I correct the details of a reported item?"
      ],
      "responses": [
          "Yes, if you need to update the details of a found item, you can do so by contacting customer support with the necessary corrections.",
          "Yes, if you need to update the details of a found item, you can do so by contacting customer support with the necessary corrections. Reach out via our [contact page](https://www.hmfi.co.za/contact)."
      ]
    },
    {
      "tag": "unsub_notifications",
      "patterns": [
        "How do I unsubscribe from notifications if I no longer want to receive them?",
        "Can I stop receiving notifications?",
        "How can I turn off notifications?"
      ],
      "responses": [
        "You can unsubscribe from notifications by updating your profile settings on the platform or by contacting customer support for assistance."
      ]
    },
    {
      "tag": "delete_account",
      "patterns": [
          "Can I delete my account from the platform?",
          "How do I remove my account?",
          "Can I delete my account"
      ],
      "responses": [
          "Yes, you can delete your account by contacting our customer support team. They will guide you through the process and ensure your data is removed from the platform."
      ]
    },
    {
      "tag": "fraud_prevention",
      "patterns": [
          "What measures are in place to prevent fraud?",
          "How do you prevent fraud on the platform?",
          "Is the platform safe from fraud?"
      ],
      "responses": [
          "We have several security measures, including verifying the authenticity of reported found items and monitoring for suspicious activity. Users are also encouraged to verify the identity of the person returning an item before meeting in person."
      ]
    },
    {
      "tag": "platform_access",
      "patterns": [
        "Is the platform accessible from mobile devices?",
        "Can I use the platform on my phone?",
        "Is there a mobile version of the platform?"
      ],
      "responses": [
        "Yes, the platform is mobile-friendly and can be accessed from smartphones and tablets, allowing you to report or search for items on the go."
      ]
    },
    {
      "tag": "delivery",
      "patterns": [
          "How long does delivery take?",
          "How long does shipping take?",
          "When do I get my delivery?"   
      ],
      "responses": [
          "Delivery takes 2-4 days",
          "Shipping takes 2-4 days"
      ]
    },
    {
      "tag": "developer",
      "patterns": [
          "Who developed you?",
          "Who is your creator?",
          "Who made this bot?",
          "Who built you?"
      ],
      "responses": [
          "I was developed by Mukwevho Gift, a software and AI developer.",
          "Mukwevho Gift, an expert in software and AI, is my creator.",
          "Mukwevho Gift is the talented software and AI developer who built me.",
          "My developer is Mukwevho Gift, specializing in software and artificial intelligence."
      ]
    },
    {
      "tag": "funny",
      "patterns": [
          "Tell me a joke!",
          "Tell me something funny!",
          "Do you know a joke?",
          "give me 3 best science jokes"
      ],
      "responses": [
          "Why did the hipster burn his mouth? He drank the coffee before it was cool.",
          "What did the buffalo say when his son left for college? Bison.",
          "Why can't you trust an atom?, Because they make up everything!",
          "What did the biologist wear to impress their date?, Designer genes!",
          "Why are chemists excellent at solving problems?, Because they have all the solutions!"
      ] 
    }
  ]
}
